ArronOC/Portfolio/PetriDish_BareMetal/drivers/Inc/stm32f101xx.h
/*
 * STM32F101xx.h
 *
 *	Contains the following
 *	Base addresses of various memories present in MCU (i.e. Flash, SRAM, ROM)
 *	Base addresses of various bus domains such as (AHBx, APBx)
 *	Base addresses of various peripherals present in different bus domains
 *	Clock management macros
 *	IRQ definitions
 *	Peripheral Register definition structures
 *	Peripheral register bit definitions
 *	Other useful MCU configuration macros
 *
 *  Created on: Oct 5, 2024
 *      Author: arron
 */

#ifndef STM32F101XX_H_
#define STM32F101XX_H_

#include <stdint.h>

#define __vo volatile

/***************************START:Processor Specific Detail***************************/
/*
 * ARM Cortex M3 Processor NVIC ISERx Register Address
 */
#define NVIC_ISER0	((__vo uint32_t*) 0xE000E100)
#define NVIC_ISER1	((__vo uint32_t*) 0xE000E104)

/*
 * ARM Cortex M3 Processor NVIC ICERx Register Address
 */
#define NVIC_ICER0	((__vo uint32_t*) 0xE000E180)
#define NVIC_ICER1	((__vo uint32_t*) 0xE000E184)

/*
 * ARM Cortex M3 Processor NVIC IPRx Register Address
 */
#define NVIC_PR_BASE_ADDR	((__vo uint32_t*) 0xE000E400)

/*
 * ARM Cortex M3 Processor number of priority bits implemented in priority register
 */
#define NO_PR_BITS_IMPLEMENTED 4

/*
 * ARM Cortex M3 Processor System timer registers
 */
#define SYST_BASE_ADDR	((__vo uint32_t*) 0xE000E010)
typedef struct {
	__vo uint32_t CTRL;
	__vo uint32_t RVR;
	__vo uint32_t CVR;
	__vo uint32_t CALIB;
}SysTick_RegDef_t;
#define Systick	((SysTick_RegDef_t*) SYST_BASE_ADDR)
/*
 * ARM Cortex M3 Processor System timer bit positions
 */
#define SYST_CSR_ENABLE		0
#define SYST_CSR_TICKINT	1
#define SYST_CSR_CLKSOURCE	2
#define SYST_CSR_COUNTFLAG	16

#define SYST_RVR_RELOAD		0

#define SYST_CVR_CURRENT	0

#define SYST_CALIB_TENMS	0
#define SYST_CALIB_SKEW		30
#define SYST_CALIB_NOREF	31

/*
 * ARM Cortex M3 Processor System Control Block Register Address
 */
#define SCB_BASE_ADDR	((__vo uint32_t*) 0xE000ED00)	// Actually starts at 0xE000E008 but we don't want to touch that register...
typedef struct {
	__vo  uint32_t CPUID;                  /*!< Offset: 0x000 (R/ )  CPUID Base Register */
	__vo uint32_t ICSR;                   /*!< Offset: 0x004 (R/W)  Interrupt Control and State Register */
	__vo uint32_t VTOR;                   /*!< Offset: 0x008 (R/W)  Vector Table Offset Register */
	__vo uint32_t AIRCR;                  /*!< Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register */
	__vo uint32_t SCR;                    /*!< Offset: 0x010 (R/W)  System Control Register */
	__vo uint32_t CCR;                    /*!< Offset: 0x014 (R/W)  Configuration Control Register */
	__vo uint8_t SHP[12];               /*!< Offset: 0x018 (R/W)  System Handlers Priority Registers (4-15) */
	__vo uint32_t SHCSR;                  /*!< Offset: 0x024 (R/W)  System Handler Control and State Register */
	__vo uint32_t CFSR;                   /*!< Offset: 0x028 (R/W)  Configurable Fault Status Register */
	__vo uint32_t HFSR;                   /*!< Offset: 0x02C (R/W)  HardFault Status Register */
	__vo uint32_t DFSR;                   /*!< Offset: 0x030 (R/W)  Debug Fault Status Register */
	__vo uint32_t MMFAR;                  /*!< Offset: 0x034 (R/W)  MemManage Fault Address Register */
	__vo uint32_t BFAR;                   /*!< Offset: 0x038 (R/W)  BusFault Address Register */
	__vo uint32_t AFSR;                   /*!< Offset: 0x03C (R/W)  Auxiliary Fault Status Register */
	__vo  uint32_t PFR[2U];                /*!< Offset: 0x040 (R/ )  Processor Feature Register */
	__vo  uint32_t DFR;                    /*!< Offset: 0x048 (R/ )  Debug Feature Register */
	__vo  uint32_t ADR;                    /*!< Offset: 0x04C (R/ )  Auxiliary Feature Register */
	__vo  uint32_t MMFR[4U];               /*!< Offset: 0x050 (R/ )  Memory Model Feature Register */
	__vo  uint32_t ISAR[5U];               /*!< Offset: 0x060 (R/ )  Instruction Set Attributes Register */
	uint32_t RESERVED0[5U];
	__vo uint32_t CPACR;                  /*!< Offset: 0x088 (R/W)  Coprocessor Access Control Register */
} SCB_Type;
#define SCB	((SCB_Type*) SCB_BASE_ADDR)

/*!< Interrupt Number Definition */
typedef enum
{
	/******  Cortex-M3 Processor Exceptions Numbers ***************************************************/
	NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                             */
	HardFault_IRQn              = -13,    /*!< 3 Cortex-M3 Hard Fault Interrupt                     */
	MemoryManagement_IRQn       = -12,    /*!< 4 Cortex-M3 Memory Management Interrupt              */
	BusFault_IRQn               = -11,    /*!< 5 Cortex-M3 Bus Fault Interrupt                      */
	UsageFault_IRQn             = -10,    /*!< 6 Cortex-M3 Usage Fault Interrupt                    */
	SVCall_IRQn                 = -5,     /*!< 11 Cortex-M3 SV Call Interrupt                       */
	DebugMonitor_IRQn           = -4,     /*!< 12 Cortex-M3 Debug Monitor Interrupt                 */
	PendSV_IRQn                 = -2,     /*!< 14 Cortex-M3 Pend SV Interrupt                       */
	SysTick_IRQn                = -1,     /*!< 15 Cortex-M3 System Tick Interrupt                   */

	/******  STM32 specific Interrupt Numbers *********************************************************/
	WWDG_IRQn                   = 0,      /*!< Window WatchDog Interrupt                            */
	PVD_IRQn                    = 1,      /*!< PVD through EXTI Line detection Interrupt            */
	TAMPER_IRQn                 = 2,      /*!< Tamper Interrupt                                     */
	RTC_IRQn                    = 3,      /*!< RTC global Interrupt                                 */
	FLASH_IRQn                  = 4,      /*!< FLASH global Interrupt                               */
	RCC_IRQn                    = 5,      /*!< RCC global Interrupt                                 */
	EXTI0_IRQn                  = 6,      /*!< EXTI Line0 Interrupt                                 */
	EXTI1_IRQn                  = 7,      /*!< EXTI Line1 Interrupt                                 */
	EXTI2_IRQn                  = 8,      /*!< EXTI Line2 Interrupt                                 */
	EXTI3_IRQn                  = 9,      /*!< EXTI Line3 Interrupt                                 */
	EXTI4_IRQn                  = 10,     /*!< EXTI Line4 Interrupt                                 */
	DMA1_Channel1_IRQn          = 11,     /*!< DMA1 Channel 1 global Interrupt                      */
	DMA1_Channel2_IRQn          = 12,     /*!< DMA1 Channel 2 global Interrupt                      */
	DMA1_Channel3_IRQn          = 13,     /*!< DMA1 Channel 3 global Interrupt                      */
	DMA1_Channel4_IRQn          = 14,     /*!< DMA1 Channel 4 global Interrupt                      */
	DMA1_Channel5_IRQn          = 15,     /*!< DMA1 Channel 5 global Interrupt                      */
	DMA1_Channel6_IRQn          = 16,     /*!< DMA1 Channel 6 global Interrupt                      */
	DMA1_Channel7_IRQn          = 17,     /*!< DMA1 Channel 7 global Interrupt                      */
	ADC1_2_IRQn                 = 18,     /*!< ADC1 and ADC2 global Interrupt                       */
	USB_HP_CAN1_TX_IRQn         = 19,     /*!< USB Device High Priority or CAN1 TX Interrupts       */
	USB_LP_CAN1_RX0_IRQn        = 20,     /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
	CAN1_RX1_IRQn               = 21,     /*!< CAN1 RX1 Interrupt                                   */
	CAN1_SCE_IRQn               = 22,     /*!< CAN1 SCE Interrupt                                   */
	EXTI9_5_IRQn                = 23,     /*!< External Line[9:5] Interrupts                        */
	TIM1_BRK_IRQn               = 24,     /*!< TIM1 Break Interrupt                                 */
	TIM1_UP_IRQn                = 25,     /*!< TIM1 Update Interrupt                                */
	TIM1_TRG_COM_IRQn           = 26,     /*!< TIM1 Trigger and Commutation Interrupt               */
	TIM1_CC_IRQn                = 27,     /*!< TIM1 Capture Compare Interrupt                       */
	TIM2_IRQn                   = 28,     /*!< TIM2 global Interrupt                                */
	TIM3_IRQn                   = 29,     /*!< TIM3 global Interrupt                                */
	TIM4_IRQn                   = 30,     /*!< TIM4 global Interrupt                                */
	I2C1_EV_IRQn                = 31,     /*!< I2C1 Event Interrupt                                 */
	I2C1_ER_IRQn                = 32,     /*!< I2C1 Error Interrupt                                 */
	I2C2_EV_IRQn                = 33,     /*!< I2C2 Event Interrupt                                 */
	I2C2_ER_IRQn                = 34,     /*!< I2C2 Error Interrupt                                 */
	SPI1_IRQn                   = 35,     /*!< SPI1 global Interrupt                                */
	SPI2_IRQn                   = 36,     /*!< SPI2 global Interrupt                                */
	USART1_IRQn                 = 37,     /*!< USART1 global Interrupt                              */
	USART2_IRQn                 = 38,     /*!< USART2 global Interrupt                              */
	USART3_IRQn                 = 39,     /*!< USART3 global Interrupt                              */
	EXTI15_10_IRQn              = 40,     /*!< External Line[15:10] Interrupts                      */
	RTC_Alarm_IRQn              = 41,     /*!< RTC Alarm through EXTI Line Interrupt                */
	USBWakeUp_IRQn              = 42,     /*!< USB Device WakeUp from suspend through EXTI Line Interrupt */
} IRQn_Type;



