ArronOC/Portfolio/PetriDish_BareMetal/drivers/Inc/stm32f101xx.h
/***************************END:Processor Specific Detail***************************/

#define HSI_CLK_FREQ	8000000	//8MHz

/*
 * Base addresses of Flash and SRAM memories
 */
#define FLASH_BASEADDR				0x08000000U
#define SRAM1_BASEADDR				0x20000000U		// only one SRAM for STM32F101xx
#define ROM_BASEADDR				0x1FFFF000U		// referred to as system memory in datasheet
#define SRAM 						SRAM1_BASEADDR	// main SRAM is SRAM1

/*
 * AHBx and APBx Bus Peripheral base addresses
 */
#define PERIPH_BASEADDR				0x40000000U	//Base address of peripheral registers
#define APB1PERIPH_BASEADDR			PERIPH_BASEADDR	//Base address of APB1 peripheral registers
#define APB2PERIPH_BASEADDR			0x40010000U	//Base address of APB2 peripheral registers
#define AHB1PERIPH_BASEADDR			0x40018000U	//Base address of AHB peripheral register (note that STM32F101xx only has one AHB, other devices could have multiple)

/*
 * Base addresses of peripherals which are hanging off AHB1 bus
 */
#define SDIO_BASEADDR				(AHB1PERIPH_BASEADDR + 0x0000)
#define DMA1_BASEADDR				(AHB1PERIPH_BASEADDR + 0x8000)
#define DMA2_BASEADDR				(AHB1PERIPH_BASEADDR + 0x8400)
#define RCC_BASEADDR				(AHB1PERIPH_BASEADDR + 0x9000)
#define FLASHINT_BASEADDR			(AHB1PERIPH_BASEADDR + 0xA000)
#define CRC_BASEADDR				(AHB1PERIPH_BASEADDR + 0xB000)
#define ETHERNET_BASEADDR			(AHB1PERIPH_BASEADDR + 0x10000)
#define USBOTGFS_BASEADDR			(AHB1PERIPH_BASEADDR + 0xFFE8000)
#define FSMC_BASEADDR				(AHB1PERIPH_BASEADDR + 0x5FFE8000)

/*
 * Base addresses of peripherals which are hanging off APB1 bus
 */
#define TIM2_BASEADDR				(APB1PERIPH_BASEADDR + 0x0000)
#define TIM3_BASEADDR				(APB1PERIPH_BASEADDR + 0x0400)
#define TIM4_BASEADDR				(APB1PERIPH_BASEADDR + 0x0800)
// TIM5 -> TIM14 not routed on STM32F101xx so not included
#define RTC_BASEADDR				(APB1PERIPH_BASEADDR + 0x2800)
#define WWDG_BASEADDR				(APB1PERIPH_BASEADDR + 0x2C00)
#define IWDG_BASEADDR				(APB1PERIPH_BASEADDR + 0x3000)
#define	SPI2_BASEADDR				(APB1PERIPH_BASEADDR + 0x3800)
#define USART2_BASEADDR				(APB1PERIPH_BASEADDR + 0x4400)
#define USART3_BASEADDR				(APB1PERIPH_BASEADDR + 0x4800)
#define UART4_BASEADDR				(APB1PERIPH_BASEADDR + 0x4C00)
#define UART5_BASEADDR				(APB1PERIPH_BASEADDR + 0x5000)
#define I2C1_BASEADDR				(APB1PERIPH_BASEADDR + 0x5400)
#define I2C2_BASEADDR				(APB1PERIPH_BASEADDR + 0x5800)
#define USBFS_BASEADDR				(APB1PERIPH_BASEADDR + 0x5C00)
#define USBCAN_BASEADDR				(APB1PERIPH_BASEADDR + 0x6000)
#define bxCAN2_BASEADDR				(APB1PERIPH_BASEADDR + 0x6800)
#define bxCAN1_BASEADDR				(APB1PERIPH_BASEADDR + 0x6400)
#define BKP_BASEADDR				(APB1PERIPH_BASEADDR + 0x6C00)
#define PWR_BASEADDR				(APB1PERIPH_BASEADDR + 0x7000)
#define DAC_BASEADDR				(APB1PERIPH_BASEADDR + 0x7400)

/*
 * Base addresses of peripherals which are hanging off APB2 bus
 */
#define AFIO_BASEADDR				(APB2PERIPH_BASEADDR + 0x0000)
#define EXTI_BASEADDR				(APB2PERIPH_BASEADDR + 0x0400)
#define GPIOA_BASEADDR				(APB2PERIPH_BASEADDR + 0x0800)
#define GPIOB_BASEADDR				(APB2PERIPH_BASEADDR + 0x0C00)
#define GPIOC_BASEADDR				(APB2PERIPH_BASEADDR + 0x1000)
#define GPIOD_BASEADDR				(APB2PERIPH_BASEADDR + 0x1400)
#define GPIOE_BASEADDR				(APB2PERIPH_BASEADDR + 0x1800)
// STM32F101xx does not have GPIOC-G routed so skipped
#define ADC1_BASEADDR				(APB2PERIPH_BASEADDR + 0x2400)
#define ADC2_BASEADDR				(APB2PERIPH_BASEADDR + 0x2800)
#define TIM1_BASEADDR				(APB2PERIPH_BASEADDR + 0x2C00)
#define SPI1_BASEADDR				(APB2PERIPH_BASEADDR + 0x3000)
#define USART1_BASEADDR				(APB2PERIPH_BASEADDR + 0x3800)
#define ADC3_BASEADDR				(APB2PERIPH_BASEADDR + 0x3C00)
// STM32F101xx does not have TIM8, TIM9, TIM10, TIM11 so skipped
#define DBGMCU_BASEADDR						0xE0042000U

/*************************peripheral register definition structures*************************/
/*
 * Note:
 * These register structures should be defined as volatile because the contents of the registers can change on each clock cycle
 * instead of writing 'volatile' the shorthand version '__vo' can be used as we defined it earlier in this header file
 */

typedef struct {
	__vo uint32_t CR;			// Clock control register
	__vo uint32_t CFGR;			// Clock configuration register
	__vo uint32_t CIR;			// Clock interrupt register
	__vo uint32_t APB2RSTR;		// APB2 peripheral reset register
	__vo uint32_t APB1RSTR;		// APB1 peripheral reset register
	__vo uint32_t AHBENR;		// AHB Peripheral Clock enable register
	__vo uint32_t APB2ENR;		// APB2 peripheral clock enable register
	__vo uint32_t APB1ENR;		// APB1 peripheral clock enable register
	__vo uint32_t BDCR;			// Backup domain control register
	__vo uint32_t CSR;			// Control/status register
	__vo uint32_t AHBSTR;		// AHB peripheral clock reset register
	__vo uint32_t CFGR2;		// Clock configuration register2
}RCC_RegDef_t;

typedef struct {
	__vo uint32_t CR[2];		// CR[0] Port configuration register low, CR[1] Port configuration register high					Address offset: 0x00
	__vo uint32_t IDR;			// Port input data register																			Address offset: 0x08
	__vo uint32_t ODR;			// Port output data register																		Address offset: 0x0C
	__vo uint32_t BSRR;			// Port bit set/reset register																		Address offset: 0x10
	__vo uint32_t BRR;			// Port bit reset register																			Address offset: 0x14
	__vo uint32_t LCKR;			// Port configuration lock register																	Address offset: 0x18
}GPIO_RegDef_t;

typedef struct {
	__vo uint32_t EVCR;			// Give a short description			Address offset: 0x00
	__vo uint32_t MAPR;			// Give a short description			Address offset: 0x04
	__vo uint32_t EXTICR[4];		// EXTICR1[0]...EXTICR4[3]			Address offset: 0x08
	__vo uint32_t MAPR2;			// Give a short description			Address offset: 0x1C
}AFIO_RegDef_t;


typedef struct {
	__vo uint32_t CR[2];		// Control Register 1 & 2		Address offset: 0x00
	__vo uint32_t SMCR;			// Slave mode control register	Address offset: 0x08
	__vo uint32_t DIER;			// DMA/Interrupt enable reg		Address offset: 0x0C
	__vo uint32_t SR;			// Status register				Address offset: 0x10
	__vo uint32_t EGR;			// Event Generation Register	Address offset: 0x14
	__vo uint32_t CCMR[2];		// Capture/Compare mode reg		Address offset: 0x18
	__vo uint32_t CCER;			// Capture/Compare enable reg	Address offset: 0x20
	__vo uint32_t CNT;			// Counter						Address offset: 0x24
	__vo uint32_t PSC;			// Prescaler					Address offset: 0x28
	__vo uint32_t ARR;			// Auto-reload register			Address offset: 0x2C
	__vo uint32_t RCR;			// Repetition Counter Register	Address offset: 0x30
	__vo uint32_t CCR[4];		// Capture/compare register		Address offset: 0x34
	__vo uint32_t BDTR;			// break and dead time reg		Address offset: 0x44
	__vo uint32_t DCR;			// DMA control register			Address offset: 0x48
	__vo uint32_t DMAR;			// DMA address for full trnsfr	Address offset: 0x4C
}TIM_RegDef_t;

