ArronOC/Portfolio/PetriDish_BareMetal/drivers/Inc/stm32f101xx.h
typedef struct {
	__vo uint32_t IMR;			// Interrupt Mask Register
	__vo uint32_t EMR;			// Event Mask Register
	__vo uint32_t RTSR;			// Rising Trigger Selection Register
	__vo uint32_t FTSR;			// Falling Trigger Selection Register
	__vo uint32_t SWIER;		// Software Interrupt Event Register
	__vo uint32_t PR;			// Pending Register
}EXTI_RegDef_t;

typedef struct {
	__vo uint32_t CR[2];		//SPI Control Register 1 & 2
	__vo uint32_t SR;			//SPI Status Register
	__vo uint32_t DR;			//SPI Data register
	__vo uint32_t CRCPR;		//SPI CRC Polynomial register
	__vo uint32_t RXCRCR;		//SPI RX CRC Register
	__vo uint32_t TXCRCR;		//SPI TX CRC Register
	__vo uint32_t I2SCFGR;		//SPI_I2S Configuration register
	__vo uint32_t I2SPR;		//SPI_I2S Prescaler register
}SPI_RegDef_t;

typedef struct {
	__vo uint32_t CR1;			//I2C Control Register 1
	__vo uint32_t CR2;			//I2C Control Register 2
	__vo uint32_t OAR[2];		//I2C Own Address Register 1 & 2
	__vo uint32_t DR;			//I2C Data Register
	__vo uint32_t SR[2];		//I2C Status Register 1 & 2
	__vo uint32_t CCR;			//I2C Clock Control Register
	__vo uint32_t TRISE;		//I2C TRISE Register (maximum rise time in Fm/Sm mode
}I2C_RegDef_t;


typedef struct {
	__vo uint32_t SR;			//USART Status Register
	__vo uint32_t DR;			//USART Data Register
	__vo uint32_t BRR;			//USART Baud Rate Register
	__vo uint32_t CR1;			//USART Control Register 1
	__vo uint32_t CR2;			//USART Control Register 2
	__vo uint32_t CR3;			//USART Control Register 3
	__vo uint32_t GTPR;			//USART Guard Time and prescaler register
}USART_RegDef_t;

typedef struct {
	__vo uint32_t IDCODE;
	__vo uint32_t CR;
}DBGMCU_RegDef_t;

/*
 * peripheral definitions (Peripheral base addresses typecasted to xxx_RegDef_t)
 */

#define RCC		((RCC_RegDef_t*)	 RCC_BASEADDR)

#define GPIOA	((GPIO_RegDef_t*) GPIOA_BASEADDR)
#define GPIOB	((GPIO_RegDef_t*) GPIOB_BASEADDR)
#define GPIOC	((GPIO_RegDef_t*) GPIOC_BASEADDR)
#define GPIOD	((GPIO_RegDef_t*) GPIOD_BASEADDR)
#define GPIOE	((GPIO_RegDef_t*) GPIOE_BASEADDR)
#define AFIO	((AFIO_RegDef_t*) AFIO_BASEADDR)

#define TIM1	((TIM_RegDef_t*) TIM1_BASEADDR)
#define TIM2	((TIM_RegDef_t*) TIM2_BASEADDR)
#define TIM3	((TIM_RegDef_t*) TIM3_BASEADDR)
#define TIM4	((TIM_RegDef_t*) TIM4_BASEADDR)

#define EXTI	((EXTI_RegDef_t*) EXTI_BASEADDR)

#define SPI1	((SPI_RegDef_t*) SPI1_BASEADDR)
#define SPI2	((SPI_RegDef_t*) SPI2_BASEADDR)

#define I2C1	((I2C_RegDef_t*) I2C1_BASEADDR)
#define I2C2	((I2C_RegDef_t*) I2C2_BASEADDR)

#define USART1	((USART_RegDef_t*) USART1_BASEADDR)
#define USART2	((USART_RegDef_t*) USART2_BASEADDR)
#define USART3	((USART_RegDef_t*) USART3_BASEADDR)

#define DBGMCU	((DBGMCU_RegDef_t*) DBGMCU_BASEADDR)
/*
 * Clock Enable/Disable/Reset Macros for GPIOx peripheral
 */
#define GPIOA_PCLK_EN()	(RCC->APB2ENR |= (0x1 << 2))	// Enable GPIOA
#define GPIOB_PCLK_EN()	(RCC->APB2ENR |= (0x1 << 3))	// Enable GPIOB
#define GPIOA_PCLK_DI()	(RCC->APB2ENR &= ~(0x1 << 2))	// Disable GPIOA
#define GPIOB_PCLK_DI()	(RCC->APB2ENR &= ~(0x1 << 3))	// Disable GPIOB
#define GPIOA_REG_RESET() do{ (RCC->APB2RSTR |= (0x1 << 2)); (RCC->APB2RSTR &= ~(0x1 << 2)); }while(0)	// Issue command to reset GPIOA, then issue command to take out of reset
#define GPIOB_REG_RESET() do{ (RCC->APB2RSTR |= (0x1 << 3)); (RCC->APB2RSTR &= ~(0x1 << 3)); }while(0)	// Issue command to reset GPIOB, then issue command to take out of reset

/*
 * Returns port code for given GPIOx base address
 * written in Conditional Or Ternary notation ":\" = else if
 */
#define GPIO_BASEADDR_TO_CODE(x)   ((x == GPIOA) ? 0 :\
									(x == GPIOB) ? 1 :\
									(x == GPIOC) ? 2 :\
									(x == GPIOD) ? 3 :\
									(x == GPIOE) ? 4 :0)

/*
 * Clock enable/Disable macro for AFIO peripheral
 */
#define AFIO_PCLK_EN()	(RCC->APB2ENR |= (0x1 << 0))	// Enable AFIO
#define AFIO_PCLK_DI()	(RCC->APB2ENR &= ~(0x1 << 0))	// Disable AFIO

/*
 * Clock enable/Disable macros for TIMER peripherals
 */
#define TIM1_PCLK_EN()	(RCC->APB2ENR |= (0x1 << 11))	// Enable TIMER1
#define TIM2_PCLK_EN()	(RCC->APB1ENR |= (0x1 << 0))	// Enable TIMER2
#define TIM3_PCLK_EN()	(RCC->APB1ENR |= (0x1 << 1))	// Enable TIMER3
#define TIM4_PCLK_EN()	(RCC->APB1ENR |= (0x1 << 2))	// Enable TIMER4
#define TIM1_PCLK_DI()	(RCC->APB2ENR &= ~(0x1 << 11))	// Disable TIMER1
#define TIM2_PCLK_DI()	(RCC->APB1ENR &= ~(0x1 << 0))	// Disable TIMER2
#define TIM3_PCLK_DI()	(RCC->APB1ENR &= ~(0x1 << 1))	// Disable TIMER3
#define TIM4_PCLK_DI()	(RCC->APB1ENR &= ~(0x1 << 2))	// Disable TIMER4

/*
 * Clock enable/Disable macros for SPI peripheral
 */
#define SPI1_PCLK_EN()	(RCC->APB2ENR |= (0x1 << 12))	// Enable SPI1
#define SPI2_PCLK_EN()	(RCC->APB1ENR |= (0x1 << 14))	// Enable SPI2
#define SPI1_PCLK_DI()	(RCC->APB2ENR &= ~(0x1 << 12))	// Disable SPI1
#define SPI2_PCLK_DI()	(RCC->APB1ENR &= ~(0x1 << 14))	// Disable SPI2

/*
 * Clock enable/Disable/reset macros for I2C peripheral
 */
#define I2C1_PCLK_EN()	(RCC->APB1ENR |= (0x1 << 21))	// Enable I2C1
#define I2C2_PCLK_EN()	(RCC->APB1ENR |= (0x1 << 22))	// Enable I2C2
#define I2C1_PCLK_DI()	(RCC->APB1ENR &= ~(0x1 << 21))	// Disable I2C1
#define I2C2_PCLK_DI()	(RCC->APB1ENR &= ~(0x1 << 22))	// Disable I2C2
#define I2C1_RST()		(RCC->APB1RSTR |= (0x1 << 21))	// Reset I2C1
#define I2C2_RST()		(RCC->APB1RSTR |= (0x1 << 22))	// Reset I2C1

/*
 * Clock enable/Disable macros for USARTx peripherals
 */
#define USART1_PCLK_EN()	(RCC->APB2ENR |= (0x1 << 14))	// Enable USART1
#define USART2_PCLK_EN()	(RCC->APB1ENR |= (0x1 << 17))	// Enable USART2
#define USART3_PCLK_EN()	(RCC->APB1ENR |= (0x1 << 18))	// Enable USART3
#define USART1_PCLK_DI()	(RCC->APB2ENR &= ~(0x1 << 14))	// Disable USART1
#define USART2_PCLK_DI()	(RCC->APB1ENR &= ~(0x1 << 17))	// Disable USART2
#define USART3_PCLK_DI()	(RCC->APB1ENR &= ~(0x1 << 18))	// Disable USART3

/*
 * Macro for checking if debugger connected (for SWV outputs)
 */
#define DEBUGGER_CONNECTED()	(DBGMCU->CR & 0x7)

// Generic Macros
#define ENABLE 1
#define DISABLE 0
#define SET ENABLE
#define RESET DISABLE
#define GPIO_PIN_SET SET
#define GPIO_PIN_RESET RESET
#define FLAG_RESET	RESET
#define FLAG_SET	SET

