ArronOC/Portfolio/PetriDish_BareMetal/drivers/Inc/stm32f101xx.h
/* =========RCC Bit macros========= */
// bit positions
#define RCC_CFGR_SWS			2
#define RCC_CFGR_HPRE			4
#define RCC_CFGR_PPRE1			8
#define RCC_CFGR_PLLSRC			16
#define RCC_CFGR_PLLXTPRE		17
#define RCC_CFGR_PLLMUL			18

// masks
#define RCC_CFGR_SWS_MASK		0xC
#define RCC_CFGR_HPRE_MASK		0xF0
#define RCC_CFGR_PPRE1_MASK		0x700
#define RCC_CFGR_PLLMUL_MASK	0x3C0000
/* ================================ */

/* =========SPI Bit macros========= */
#define	SPI_CR1_BIDIMODE	15
#define SPI_CR1_BIDIOE		14
#define SPI_CR1_CRCEN		13
#define SPI_CR1_CRCNEXT		12
#define SPI_CR1_DFF			11
#define SPI_CR1_RXONLY		10
#define SPI_CR1_SSM			9
#define SPI_CR1_SSI			8
#define SPI_CR1_LSBFIRST	7
#define SPI_CR1_SPE			6
#define SPI_CR1_BR			3
#define SPI_CR1_MSTR		2
#define SPI_CR1_CPOL		1
#define SPI_CR1_CPHA		0

#define SPI_CR2_TXEIE		7
#define SPI_CR2_RXNEIE		6
#define SPI_CR2_ERRIE		5
#define SPI_CR2_SSOE		2
#define SPI_CR2_TXDMAEN		1
#define SPI_CR2_RXDMAEN		0

#define SPI_SR_BSY			7
#define SPI_SR_OVR			6
#define SPI_SR_MODF			5
#define SPI_SR_CRCERR		4
#define SPI_SR_UDR			3
#define SPI_SR_CHSIDE		2
#define SPI_SR_TXE			1
#define SPI_SR_RXNE			0
/* ================================ */

/* =========I2C Bit macros========= */
#define I2C_CR1_SWRST		15
#define I2C_CR1_ALERT		13
#define I2C_CR1_PEC			12
#define I2C_CR1_POS			11
#define I2C_CR1_ACK			10
#define I2C_CR1_STOP		9
#define I2C_CR1_START		8
#define I2C_CR1_NOSTRETCH	7
#define I2C_CR1_ENGC		6
#define I2C_CR1_ENPEC		5
#define I2C_CR1_ENARP		4
#define I2C_CR1_SMBTYPE		3
#define I2C_CR1_SMBUS		1
#define I2C_CR1_PE			0

#define I2C_CR2_LAST		12
#define I2C_CR2_DMAEN		11
#define I2C_CR2_ITBUFEN		10
#define I2C_CR2_ITEVTEN		9
#define I2C_CR2_ITERREN		8
#define I2C_CR2_FREQ		0

#define I2C_OAR1_ADDMODE	15
#define I2C_OAR1_ADDR7BIT	1
#define I2C_OAR1_ADDR10BIT	0

#define I2C_OAR2_ADDR2		1
#define I2C_OAR2_ENDUAL		0

#define I2C_SR1_SMBALERT	15
#define I2C_SR1_TIMEOUT		14
#define I2C_SR1_PECERR		12
#define I2C_SR1_OVR			11
#define I2C_SR1_AF			10
#define I2C_SR1_ARLO		9
#define I2C_SR1_BERR		8
#define I2C_SR1_TxE			7
#define I2C_SR1_RxNE		6
#define I2C_SR1_STOPF		4
#define I2C_SR1_ADD10		3
#define I2C_SR1_BTF			2
#define I2C_SR1_ADDR		1
#define I2C_SR1_SB			0

#define I2C_SR2_PEC			8
#define I2C_SR2_DUALF		7
#define I2C_SR2_SMBHOST		6
#define I2C_SR2_SMBDEFAULT	5
#define I2C_SR2_GENCALL		4
#define I2C_SR2_TRA			2
#define I2C_SR2_BUSY		1
#define I2C_SR2_MSL			0

#define I2C_CCR_FS			15
#define I2C_CCR_DUTY		14
#define I2C_CCR_CCR			0

#define I2C_TRISE_TRISE		0
/* ================================ */

/* =========USART Bit macros========= */
// bit positions
#define USART_SR_POS_PE		0
#define USART_SR_POS_FE		1
#define USART_SR_POS_NE		2
#define USART_SR_POS_ORE	3
#define USART_SR_POS_IDLE	4
#define USART_SR_POS_RXNE	5
#define USART_SR_POS_TC		6
#define USART_SR_POS_TXE	7
#define USART_SR_POS_LBD	8
#define USART_SR_POS_CTS	9

#define USART_BRR_POS_DIVfraction	0
#define USART_BRR_POS_DIVMantissa	4

#define USART_CR1_POS_SBK		0
#define USART_CR1_POS_RWU		1
#define USART_CR1_POS_RE		2
#define USART_CR1_POS_TE		3
#define USART_CR1_POS_IDLEIE	4
#define USART_CR1_POS_RXNEIE	5
#define USART_CR1_POS_TCIE		6
#define USART_CR1_POS_TXEIE		7
#define USART_CR1_POS_PEIE		8
#define USART_CR1_POS_PS		9
#define USART_CR1_POS_PCE		10
#define USART_CR1_POS_WAKE		11
#define USART_CR1_POS_M			12
#define USART_CR1_POS_UE		13

#define USART_CR2_POS_ADD		0
#define USART_CR2_POS_LBDL		5
#define USART_CR2_POS_LBDIE		6
#define USART_CR2_POS_LBCL		8
#define USART_CR2_POS_CPHA		9
#define USART_CR2_POS_CPOL		10
#define USART_CR2_POS_CLKEN		11
#define USART_CR2_POS_STOP		12
#define USART_CR2_POS_LINEN		14

#define USART_CR3_POS_EIE		0
#define USART_CR3_POS_IREN		1
#define USART_CR3_POS_IRLP		2
#define USART_CR3_POS_HDSEL		3
#define USART_CR3_POS_NACK		4
#define USART_CR3_POS_SCEN		5
#define USART_CR3_POS_DMAR		6
#define USART_CR3_POS_DMAT		7
#define USART_CR3_POS_RTSE		8
#define USART_CR3_POS_CTSE		9
#define USART_CR3_POS_CTSIE		10

#define USART_GTPR_POS_PSC		0
#define USART_GTPR_POS_GT		8
/* ================================ */

/* ================================ */
#include "stm32f101xx_gpio_driver.h"
#include "stm32f101xx_rcc_driver.h"
#include "stm32f101xx_afio_driver.h"
#include "stm32f101xx_tim_driver.h"
#include "stm32f101xx_spi_driver.h"
#include "stm32f101xx_i2c_driver.h"
#include "stm32f101xx_usart_driver.h"

/**************************************************************************
 * 						APIs supported by this driver
 * 		For more information about the APIs check the function definitions
 *************************************************************************/
void SYST_Config(uint32_t SystemClockHz);
void DELAY_MS(uint32_t ms);
void SysTick_Handler(void);
uint32_t ELAPSED_MS(void);
void SYST_STARTorSTOP(uint8_t ENorDI);
void NVIC_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority);
void NVIC_IRQITConfig(uint8_t IRQNumber, uint8_t EnorDi);

#endif /* STM32F101XX_H_ */
